exercise-snappyhexmesh/heatedChannel/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    // inlet
    // {
    //     type            timeVaryingMappedFixedValue;
    //     offset          (0 0 0);
    //     setAverage      off;
    // }

    inlet
    {
        type            fixedValue;
        value           uniform (5 0 0);
    }

    // outlet
    // {
    //     type            zeroGradient;
    // }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
    }

    "wall.*"
    {
        type            noSlip;
    }

    "front|back"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
